const arrind = [
    "Зберігати дані",
    "Гуртувати дані",
    "Сортувати дані",
    "Швидко додавати або видаляти данні",
    "Пошук елементів с заданими значеннями",
    "Сумування елементів масиву",
    "Структуроване зберігання даних"
];
console.log(arrind);


const book1 = {
    title: "Da Vinci Code",
    pageCount: "519",
    genre: "detective novel"
};
console.log(book1);

// book1.authors = "Dan Brown";

book1.authors = [
    {
        name: "Dan Brown",
        age: "59"
    }
];
console.log(book1.authors);



// Створюємо масив з 10 користувачів
const users = [];

for(let i = 1; i <= 10; i++) {
    const user = {
        name: `Ім'я ${i}`,
        username: `Користувач ${i}`,
        password: `Пароль ${i}`
    };
    users.push(user);
}
// Шаблонні літерали (літерали шаблону) використовують зворотні галочки (``), а не лапки (""), щоб визначити рядок

// Літерали шаблонів забезпечують простий спосіб інтерполяції змінних і виразів у рядки.
// Цей метод називається інтерполяцією рядка.
// ${...}

// Виводимо в консоль пароль кожного користувача
users.forEach(user => {
    console.log(`Пароль користувача ${user.username}: ${user.password}`);
});

// ___________________________________________________________________________________________________________________


let arrOne = [
    "Зберігати дані",
    "Гуртувати дані",
    "Сортувати дані",
    "Швидко додавати або видаляти данні",
    "Пошук елементів с заданими значеннями",
    "Сумування елементів масиву",
    "Структуроване зберігання даних"
];
console.log(arrOne);
// видаляє елемент
arrOne.splice(1,1);
// починаючи з першої позиції  видаляєм  один елемент
console.log(arrOne);

let arrTwo = [
    "Зберігати дані",
    "Гуртувати дані",
    "Сортувати дані",
    "Швидко додавати або видаляти данні",
    "Пошук елементів с заданими значеннями",
    "Сумування елементів масиву",
    "Структуроване зберігання даних"
];
console.log(arrTwo);
let removed = arrTwo.splice(1,1);
// видаляєм елемент і повертаєм його у змінну
console.log(removed);
 

let arrThree = [
    "Зберігати дані",
    "Гуртувати дані",
    "Сортувати дані",
    "Швидко додавати або видаляти данні",
    "Пошук елементів с заданими значеннями",
    "Сумування елементів масиву",
    "Структуроване зберігання даних"
];
console.log(arrThree);
arrThree.splice(1, 1, "Придумай сам");
// заміна елементу
console.log(arrThree);


// додаємо елементи

let arrFour = [
    "Зберігати дані",
    "Гуртувати дані",
    "Сортувати дані",
    "Швидко додавати або видаляти данні",
    "Пошук елементів с заданими значеннями",
    "Сумування елементів масиву",
    "Структуроване зберігання даних"
];
console.log(arrFour);
arrFour.splice(6, 0, "You must", "learn JS");
// додаєм елементи
console.log(arrFour);


// метод перебору елементів
let arr5 = [
    "Зберігати дані",
    "Гуртувати дані",
    "Сортувати дані",
    "Швидко додавати або видаляти данні",
    "Пошук елементів с заданими значеннями",
    "Сумування елементів масиву",
    "Структуроване зберігання даних"
];
arr5.forEach(function(item, index, array){
    console.log(`${item} знаходиться на ${index} позиції в масиві: ${array}` );
});
// стрілочна функція =>
arr5.forEach((item, index, array)=>{
    console.log(`${item} знаходиться на ${index} позиції в масиві: ${array}` );
});

